<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created on January 6, 2012 by texi2html 5.0
texi2html was written by: 
            Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people.
Send bugs and suggestions to <texi2html-bug@nongnu.org>
-->
<head>
<title>Untitled Document</title>

<meta name="description" content="Untitled Document">
<meta name="keywords" content="Untitled Document">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 5.0">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smalllisp {margin-left: 3.2em}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:pre}
span.nolinebreak {white-space:pre}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
-->
</style>


</head>

<body lang="en" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#Introduction-to-graphs">1 Introduction to graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#Functions-and-Variables-for-graphs">2 Functions and Variables for graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<a name="Introduction-to-graphs"></a>
<table class="header" cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[ &lt;&lt; ]</td>
<td valign="middle" align="left">[ &lt; ]</td>
<td valign="middle" align="left">[ Up ]</td>
<td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[Contents]</td>
<td valign="middle" align="left">[Index]</td>
<td valign="middle" align="left">[<a href="#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<a name="Introduction-to-graphs-1"></a>
<h2 class="section">1 Introduction to graphs</h2>

<p>The <code>graphs</code> package provides graph and digraph data structure for
Maxima. Graphs and digraphs are simple (have no multiple edges nor
loops), although digraphs can have a directed edge from <var>u</var> to
<var>v</var> and a directed edge from <var>v</var> to <var>u</var>.
</p>
<p>Internally graphs are represented by adjacency lists and implemented as
a lisp structures. Vertices are identified by their ids (an id is an
integer). Edges/arcs are represented by lists of length 2. Labels can be
assigned to vertices of graphs/digraphs and weights can be assigned to
edges/arcs of graphs/digraphs.
</p>
<p>There is a <code>draw_graph</code> function for drawing graphs. Graphs are
drawn using a force based vertex positioning
algorithm. <code>draw_graph</code> can also use graphviz programs available
from <a href="http://www.graphviz.org">http://www.graphviz.org</a>. <code>draw_graph</code> is based on the maxima
<code>draw</code> package.
</p>
<p>To use the <code>graphs</code> package, first load it with <code>load(graphs)</code>.
</p>
<p>@opencatbox
@category{Share packages} @category{Package graphs}
@closecatbox
</p>
<hr>
<a name="Functions-and-Variables-for-graphs"></a>
<table class="header" cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[ Up ]</td>
<td valign="middle" align="left">[<a href="#Building-graphs" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left">[ &gt;&gt; ]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[Contents]</td>
<td valign="middle" align="left">[Index]</td>
<td valign="middle" align="left">[<a href="#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<a name="Functions-and-Variables-for-graphs-1"></a>
<h2 class="section">2 Functions and Variables for graphs</h2>

<hr>
<a name="Building-graphs"></a>
<table class="header" cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="#Graph-properties" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left">[ &gt;&gt; ]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[Contents]</td>
<td valign="middle" align="left">[Index]</td>
<td valign="middle" align="left">[<a href="#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection">2.1 Building graphs</h3>

<dl>
<dt><a name="index-create_005fgraph"></a>Function: <strong>create_graph</strong><em> (<var>v_list</var>, <var>e_list</var>)</em></dt>
<dt><a name="index-create_005fgraph-1"></a>Function: <strong>create_graph</strong><em> (<var>n</var>, <var>e_list</var>)</em></dt>
<dt><a name="index-create_005fgraph-2"></a>Function: <strong>create_graph</strong><em> (<var>v_list</var>, <var>e_list</var>, <var>directed</var>)</em></dt>
<dd><p>Creates a new graph on the set of vertices <var>v_list</var> and with edges <var>e_list</var>.
</p>
<p><var>v_list</var> is a list of vertices (<code>[v1, v2,..., vn]</code>) or a
list of vertices together with vertex labels (<code>[[v1,l1], [v2,l2],..., [vn,ln]]</code>).
</p>
<p><var>n</var> is the number of vertices. Vertices will be identified by integers from 0 to n-1.
</p>
<p><var>e_list</var> is a list of edges (<code>[e1, e2,..., em]</code>) or a list of
edges together with edge-weights (<code>[[e1, w1], ..., [em, wm]]</code>).
</p>
<p>If <var>directed</var> is not <code>false</code>, a directed graph will be returned.
</p>
<p>Example 1: create a cycle on 3 vertices:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[1,2], [2,3], [1,3]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre></div>

<p>Example 2: create a cycle on 3 vertices with edge weights:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[[1,2], 1.0], [[2,3], 2.0],
                          [[1,3], 3.0]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre></div>

<p>Example 3: create a directed graph:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) d : create_graph(
        [1,2,3,4],
        [
         [1,3], [1,4],
         [2,3], [2,4]
        ],
        'directed = true)$
(%i3) print_graph(d)$
Digraph on 4 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :
  2 :  4  3
  1 :  4  3
</pre></div>

<p>@opencatbox
@category{Package graphs}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-copy_005fgraph"></a>Function: <strong>copy_graph</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns a copy of the graph <var>g</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-circulant_005fgraph"></a>Function: <strong>circulant_graph</strong><em> (<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Returns the circulant graph with parameters <var>n</var> and <var>d</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : circulant_graph(10, [1,3])$
(%i3) print_graph(g)$
Graph on 10 vertices with 20 edges.
Adjacencies:
  9 :  2  6  0  8
  8 :  1  5  9  7
  7 :  0  4  8  6
  6 :  9  3  7  5
  5 :  8  2  6  4
  4 :  7  1  5  3
  3 :  6  0  4  2
  2 :  9  5  3  1
  1 :  8  4  2  0
  0 :  7  3  9  1
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-clebsch_005fgraph"></a>Function: <strong>clebsch_graph</strong><em> ()</em></dt>
<dd><p>Returns the Clebsch graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-complement_005fgraph"></a>Function: <strong>complement_graph</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns the complement of the graph <var>g</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-complete_005fbipartite_005fgraph"></a>Function: <strong>complete_bipartite_graph</strong><em> (<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Returns the complete bipartite graph on <var>n+m</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-complete_005fgraph"></a>Function: <strong>complete_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the complete graph on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-cycle_005fdigraph"></a>Function: <strong>cycle_digraph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the directed cycle on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-cycle_005fgraph"></a>Function: <strong>cycle_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the cycle on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-cuboctahedron_005fgraph"></a>Function: <strong>cuboctahedron_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the cuboctahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-cube_005fgraph"></a>Function: <strong>cube_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the <var>n</var>-dimensional cube.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-dodecahedron_005fgraph"></a>Function: <strong>dodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the dodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-empty_005fgraph"></a>Function: <strong>empty_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the empty graph on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-flower_005fsnark"></a>Function: <strong>flower_snark</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the flower graph on <var>4n</var> vertices.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) f5 : flower_snark(5)$
(%i3) chromatic_index(f5);
(%o3)                           4
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-from_005fadjacency_005fmatrix"></a>Function: <strong>from_adjacency_matrix</strong><em> (<var>A</var>)</em></dt>
<dd><p>Returns the graph represented by its adjacency matrix <var>A</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-frucht_005fgraph"></a>Function: <strong>frucht_graph</strong><em> ()</em></dt>
<dd><p>Returns the Frucht graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005fproduct"></a>Function: <strong>graph_product</strong><em> (<var>g1</var>, <var>g1</var>)</em></dt>
<dd><p>Returns the direct product of graphs <var>g1</var> and <var>g2</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) grid : graph_product(path_graph(3), path_graph(4))$
(%i3) draw_graph(grid)$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<img src="figures/graphs01.gif" alt="figures/graphs01">

<dl>
<dt><a name="index-graph_005funion"></a>Function: <strong>graph_union</strong><em> (<var>g1</var>, <var>g1</var>)</em></dt>
<dd><p>Returns the union (sum) of graphs <var>g1</var> and <var>g2</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-grid_005fgraph"></a>Function: <strong>grid_graph</strong><em> (<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Returns the <var>n x m</var> grid.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-great_005frhombicosidodecahedron_005fgraph"></a>Function: <strong>great_rhombicosidodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the great rhombicosidodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-great_005frhombicuboctahedron_005fgraph"></a>Function: <strong>great_rhombicuboctahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the great rhombicuboctahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-grotzch_005fgraph"></a>Function: <strong>grotzch_graph</strong><em> ()</em></dt>
<dd><p>Returns the Grotzch graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-heawood_005fgraph"></a>Function: <strong>heawood_graph</strong><em> ()</em></dt>
<dd><p>Returns the Heawood graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-icosahedron_005fgraph"></a>Function: <strong>icosahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the icosahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-icosidodecahedron_005fgraph"></a>Function: <strong>icosidodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the icosidodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-induced_005fsubgraph"></a>Function: <strong>induced_subgraph</strong><em> (<var>V</var>, <var>g</var>)</em></dt>
<dd><p>Returns the graph induced on the subset <var>V</var> of vertices of the graph
<var>g</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) V : [0,1,2,3,4]$
(%i4) g : induced_subgraph(V, p)$
(%i5) print_graph(g)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  3  0
  3 :  2  4
  2 :  1  3
  1 :  0  2
  0 :  1  4
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-line_005fgraph"></a>Function: <strong>line_graph</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns the line graph of the graph <var>g</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-make_005fgraph"></a>Function: <strong>make_graph</strong><em> (<var>vrt</var>, <var>f</var>)</em></dt>
<dt><a name="index-make_005fgraph-1"></a>Function: <strong>make_graph</strong><em> (<var>vrt</var>, <var>f</var>, <var>oriented</var>)</em></dt>
<dd><p>Creates a graph using a predicate function <var>f</var>.
</p>
<p><var>vrt</var> is a list/set of vertices or an integer. If <var>vrt</var> is an
integer, then vertices of the graph will be integers from 1 to
<var>vrt</var>.
</p>
<p><var>f</var> is a predicate function. Two vertices <var>a</var> and <var>b</var> will
be connected if <code>f(a,b)=true</code>.
</p>
<p>If <var>directed</var> is not <var>false</var>, then the graph will be directed.
</p>
<p>Example 1:
</p><div class="example">
<pre class="example">(%i1) load(graphs)$
(%i2) g : make_graph(powerset({1,2,3,4,5}, 2), disjointp)$
(%i3) is_isomorphic(g, petersen_graph());
(%o3)                         true
(%i4) get_vertex_label(1, g);
(%o4)                        {1, 2}
</pre></div>

<p>Example 2:
</p><div class="example">
<pre class="example">(%i1) load(graphs)$
(%i2) f(i, j) := is (mod(j, i)=0)$
(%i3) g : make_graph(20, f, directed=true)$
(%i4) out_neighbors(4, g);
(%o4)                    [8, 12, 16, 20]
(%i5) in_neighbors(18, g);
(%o5)                    [1, 2, 3, 6, 9]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-mycielski_005fgraph"></a>Function: <strong>mycielski_graph</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns the mycielskian graph of the graph <var>g</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-new_005fgraph"></a>Function: <strong>new_graph</strong><em> ()</em></dt>
<dd><p>Returns the graph with no vertices and no edges.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-path_005fdigraph"></a>Function: <strong>path_digraph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the directed path on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-path_005fgraph"></a>Function: <strong>path_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the path on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-petersen_005fgraph"></a>Function: <strong>petersen_graph</strong><em> ()</em></dt>
<dt><a name="index-petersen_005fgraph-1"></a>Function: <strong>petersen_graph</strong><em> (<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Returns the petersen graph <var>P_{n,d}</var>. The default values for
<var>n</var> and <var>d</var> are <code>n=5</code> and <code>d=2</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fbipartite_005fgraph"></a>Function: <strong>random_bipartite_graph</strong><em> (<var>a</var>, <var>b</var>, <var>p</var>)</em></dt>
<dd><p>Returns a random bipartite graph on <code>a+b</code> vertices. Each edge is
present with probability <var>p</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fdigraph"></a>Function: <strong>random_digraph</strong><em> (<var>n</var>, <var>p</var>)</em></dt>
<dd><p>Returns a random directed graph on <var>n</var> vertices. Each arc is present
with probability <var>p</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fregular_005fgraph"></a>Function: <strong>random_regular_graph</strong><em> (<var>n</var>)</em></dt>
<dt><a name="index-random_005fregular_005fgraph-1"></a>Function: <strong>random_regular_graph</strong><em> (<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Returns a random <var>d</var>-regular graph on <var>n</var> vertices. The default
value for <var>d</var> is <code>d=3</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fgraph"></a>Function: <strong>random_graph</strong><em> (<var>n</var>, <var>p</var>)</em></dt>
<dd><p>Returns a random graph on <var>n</var> vertices. Each edge is present with
probability <var>p</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fgraph1"></a>Function: <strong>random_graph1</strong><em> (<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Returns a random graph on <var>n</var> vertices and random <var>m</var> edges.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005fnetwork"></a>Function: <strong>random_network</strong><em> (<var>n</var>, <var>p</var>, <var>w</var>)</em></dt>
<dd><p>Returns a random network on <var>n</var> vertices. Each arc is present with
probability <var>p</var> and has a weight in the range <code>[0,w]</code>. The
function returns a list <code>[network, source, sink]</code>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) [net, s, t] : random_network(50, 0.2, 10.0);
(%o2)                   [DIGRAPH, 50, 51]
(%i3) max_flow(net, s, t)$
(%i4) first(%);
(%o4)                   27.65981397932507
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005ftournament"></a>Function: <strong>random_tournament</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns a random tournament on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-random_005ftree"></a>Function: <strong>random_tree</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns a random tree on <var>n</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-small_005frhombicosidodecahedron_005fgraph"></a>Function: <strong>small_rhombicosidodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the small rhombicosidodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-small_005frhombicuboctahedron_005fgraph"></a>Function: <strong>small_rhombicuboctahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the small rhombicuboctahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-snub_005fcube_005fgraph"></a>Function: <strong>snub_cube_graph</strong><em> ()</em></dt>
<dd><p>Returns the snub cube graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-snub_005fdodecahedron_005fgraph"></a>Function: <strong>snub_dodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the snub dodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-truncated_005fcube_005fgraph"></a>Function: <strong>truncated_cube_graph</strong><em> ()</em></dt>
<dd><p>Returns the truncated cube graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-truncated_005fdodecahedron_005fgraph"></a>Function: <strong>truncated_dodecahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the truncated dodecahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>


<dl>
<dt><a name="index-truncated_005ficosahedron_005fgraph"></a>Function: <strong>truncated_icosahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the truncated icosahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>


<dl>
<dt><a name="index-truncated_005ftetrahedron_005fgraph"></a>Function: <strong>truncated_tetrahedron_graph</strong><em> ()</em></dt>
<dd><p>Returns the truncated tetrahedron graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-tutte_005fgraph"></a>Function: <strong>tutte_graph</strong><em> ()</em></dt>
<dd><p>Returns the Tutte graph.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-underlying_005fgraph"></a>Function: <strong>underlying_graph</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns the underlying graph of the directed graph <var>g</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-wheel_005fgraph"></a>Function: <strong>wheel_graph</strong><em> (<var>n</var>)</em></dt>
<dd><p>Returns the wheel graph on <var>n+1</var> vertices.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - constructions}
@closecatbox
</p></dd></dl>

<hr>
<a name="Graph-properties"></a>
<table class="header" cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#Building-graphs" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#Functions-and-Variables-for-graphs" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="#Modifying-graphs" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left">[ &gt;&gt; ]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#Introduction-to-graphs" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[Contents]</td>
<td valign="middle" align="left">[Index]</td>
<td valign="middle" align="left">[<a href="#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection">2.2 Graph properties</h3>

<dl>
<dt><a name="index-adjacency_005fmatrix"></a>Function: <strong>adjacency_matrix</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the adjacency matrix of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(4)$
(%i3) adjacency_matrix(c5);
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
(%o3)                    [            ]
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-average_005fdegree"></a>Function: <strong>average_degree</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the average degree of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) average_degree(grotzch_graph());
                               40
(%o2)                          --
                               11
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-biconnected_005fcomponents"></a>Function: <strong>biconnected_components</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the (vertex sets of) 2-connected components of the graph
<var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(
            [1,2,3,4,5,6,7],
            [
             [1,2],[2,3],[2,4],[3,4],
             [4,5],[5,6],[4,6],[6,7]
            ])$
(%i3) biconnected_components(g);
(%o3)        [[6, 7], [4, 5, 6], [1, 2], [2, 3, 4]]
</pre></div>

<img src="figures/graphs13.gif" alt="figures/graphs13">

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-bipartition"></a>Function: <strong>bipartition</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns a bipartition of the vertices of the graph <var>gr</var> or an empty
list if <var>gr</var> is not bipartite.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) h : heawood_graph()$
(%i3) [A,B]:bipartition(h);
(%o3)  [[8, 12, 6, 10, 0, 2, 4], [13, 5, 11, 7, 9, 1, 3]]
(%i4) draw_graph(h, show_vertices=A, program=circular)$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs02.gif" alt="figures/graphs02">

<dl>
<dt><a name="index-chromatic_005findex"></a>Function: <strong>chromatic_index</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the chromatic index of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) chromatic_index(p);
(%o3)                           4
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-chromatic_005fnumber"></a>Function: <strong>chromatic_number</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the chromatic number of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) chromatic_number(cycle_graph(5));
(%o2)                           3
(%i3) chromatic_number(cycle_graph(6));
(%o3)                           2
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-clear_005fedge_005fweight"></a>Function: <strong>clear_edge_weight</strong><em> (<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Removes the weight of the edge  <var>e</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(3, [[[0,1], 1.5], [[1,2], 1.3]])$
(%i3) get_edge_weight([0,1], g);
(%o3)                          1.5
(%i4) clear_edge_weight([0,1], g)$
(%i5) get_edge_weight([0,1], g);
(%o5)                           1
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-clear_005fvertex_005flabel"></a>Function: <strong>clear_vertex_label</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Removes the label of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                         Zero
(%i4) clear_vertex_label(0, g);
(%o4)                         done
(%i5) get_vertex_label(0, g);
(%o5)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-connected_005fcomponents"></a>Function: <strong>connected_components</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the (vertex sets of) connected components of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g: graph_union(cycle_graph(5), path_graph(4))$
(%i3) connected_components(g);
(%o3)            [[1, 2, 3, 4, 0], [8, 7, 6, 5]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-diameter"></a>Function: <strong>diameter</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the diameter of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) diameter(dodecahedron_graph());
(%o2)                           5
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-edge_005fcoloring"></a>Function: <strong>edge_coloring</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns an optimal coloring of the edges of the graph <var>gr</var>.
</p>
<p>The function returns the chromatic index and a list representing the
coloring of the edges of <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) [ch_index, col] : edge_coloring(p);
(%o3) [4, [[[0, 5], 3], [[5, 7], 1], [[0, 1], 1], [[1, 6], 2], 
[[6, 8], 1], [[1, 2], 3], [[2, 7], 4], [[7, 9], 2], [[2, 3], 2], 
[[3, 8], 3], [[5, 8], 2], [[3, 4], 1], [[4, 9], 4], [[6, 9], 3], 
[[0, 4], 2]]]
(%i4) assoc([0,1], col);
(%o4)                           1
(%i5) assoc([0,5], col);
(%o5)                           3
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-degree_005fsequence"></a>Function: <strong>degree_sequence</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the list of vertex degrees of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) degree_sequence(random_graph(10, 0.4));
(%o2)            [2, 2, 2, 2, 2, 2, 3, 3, 3, 3]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-edge_005fconnectivity"></a>Function: <strong>edge_connectivity</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the edge-connectivity of the graph <var>gr</var>.
</p>
<p>See also <code>min_edge_cut</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-edges"></a>Function: <strong>edges</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the list of edges (arcs) in a (directed) graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) edges(complete_graph(4));
(%o2)   [[2, 3], [1, 3], [1, 2], [0, 3], [0, 2], [0, 1]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-get_005fedge_005fweight"></a>Function: <strong>get_edge_weight</strong><em> (<var>e</var>, <var>gr</var>)</em></dt>
<dt><a name="index-get_005fedge_005fweight-1"></a>Function: <strong>get_edge_weight</strong><em> (<var>e</var>, <var>gr</var>, <var>ifnot</var>)</em></dt>
<dd><p>Returns the weight of the edge <var>e</var> in the graph <var>gr</var>.
</p>
<p>If there is no weight assigned to the edge, the function returns 1. If
the edge is not present in the graph, the function signals an error or
returns the optional argument <var>ifnot</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) get_edge_weight([1,2], c5);
(%o3)                           1
(%i4) set_edge_weight([1,2], 2.0, c5);
(%o4)                         done
(%i5) get_edge_weight([1,2], c5);
(%o5)                          2.0
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-get_005fvertex_005flabel"></a>Function: <strong>get_vertex_label</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the label of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                         Zero
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005fcharpoly"></a>Function: <strong>graph_charpoly</strong><em> (<var>gr</var>, <var>x</var>)</em></dt>
<dd><p>Returns the characteristic polynomial (in variable <var>x</var>) of the graph
<var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_charpoly(p, x), factor;
                                   5        4
(%o3)               (x - 3) (x - 1)  (x + 2)
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005fcenter"></a>Function: <strong>graph_center</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the center of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_center(g);
(%o3)                         [12]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005feigenvalues"></a>Function: <strong>graph_eigenvalues</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the eigenvalues of the graph <var>gr</var>. The function returns
eigenvalues in the same format as maxima <code>eigenvalue</code> function.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_eigenvalues(p);
(%o3)               [[3, - 2, 1], [1, 4, 5]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005fperiphery"></a>Function: <strong>graph_periphery</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the periphery of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_periphery(g);
(%o3)                    [24, 20, 4, 0]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005fsize"></a>Function: <strong>graph_size</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the number of edges in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_size(p);
(%o3)                          15
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-graph_005forder"></a>Function: <strong>graph_order</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the number of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_order(p);
(%o3)                          10
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-girth"></a>Function: <strong>girth</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the length of the shortest cycle in <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : heawood_graph()$
(%i3) girth(g);
(%o3)                           6
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-hamilton_005fcycle"></a>Function: <strong>hamilton_cycle</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the Hamilton cycle of the graph <var>gr</var> or an empty list if
<var>gr</var> is not hamiltonian.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c : cube_graph(3)$
(%i3) hc : hamilton_cycle(c);
(%o3)              [7, 3, 2, 6, 4, 0, 1, 5, 7]
(%i4) draw_graph(c, show_edges=vertices_to_cycle(hc))$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs03.gif" alt="figures/graphs03">

<dl>
<dt><a name="index-hamilton_005fpath"></a>Function: <strong>hamilton_path</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the Hamilton path of the graph <var>gr</var> or an empty list if
<var>gr</var> does not have a Hamilton path.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) hp : hamilton_path(p);
(%o3)            [0, 5, 7, 2, 1, 6, 8, 3, 4, 9]
(%i4) draw_graph(p, show_edges=vertices_to_path(hp))$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs04.gif" alt="figures/graphs04">

<dl>
<dt><a name="index-isomorphism"></a>Function: <strong>isomorphism</strong><em> (<var>gr1</var>, <var>gr2</var>)</em></dt>
<dd>
<p>Returns a an isomorphism between graphs/digraphs <var>gr1</var> and
<var>gr2</var>. If <var>gr1</var> and <var>gr2</var> are not isomorphic, it returns
an empty list.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) isomorphism(clk5, petersen_graph());
(%o3) [9 -&gt; 0, 2 -&gt; 1, 6 -&gt; 2, 5 -&gt; 3, 0 -&gt; 4, 1 -&gt; 5, 3 -&gt; 6, 
                                          4 -&gt; 7, 7 -&gt; 8, 8 -&gt; 9]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-in_005fneighbors"></a>Function: <strong>in_neighbors</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the list of in-neighbors of the vertex <var>v</var> in the directed
graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                          [1]
(%i4) out_neighbors(2, p);
(%o4)                          []
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fbiconnected"></a>Function: <strong>is_biconnected</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is 2-connected and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_biconnected(cycle_graph(5));
(%o2)                         true
(%i3) is_biconnected(path_graph(5));
(%o3)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fbipartite"></a>Function: <strong>is_bipartite</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is bipartite (2-colorable) and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_bipartite(petersen_graph());
(%o2)                         false
(%i3) is_bipartite(heawood_graph());
(%o3)                         true
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fconnected"></a>Function: <strong>is_connected</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if the graph <var>gr</var> is connected and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_connected(graph_union(cycle_graph(4), path_graph(3)));
(%o2)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fdigraph"></a>Function: <strong>is_digraph</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a directed graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_digraph(path_graph(5));
(%o2)                         false
(%i3) is_digraph(path_digraph(5));
(%o3)                         true
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fedge_005fin_005fgraph"></a>Function: <strong>is_edge_in_graph</strong><em> (<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>e</var> is an edge (arc) in the (directed) graph <var>g</var>
and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_edge_in_graph([2,3], c4);
(%o3)                         true
(%i4) is_edge_in_graph([3,2], c4);
(%o4)                         true
(%i5) is_edge_in_graph([2,4], c4);
(%o5)                         false
(%i6) is_edge_in_graph([3,2], cycle_digraph(4));
(%o6)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fgraph"></a>Function: <strong>is_graph</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_graph(path_graph(5));
(%o2)                         true
(%i3) is_graph(path_digraph(5));
(%o3)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fgraph_005for_005fdigraph"></a>Function: <strong>is_graph_or_digraph</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a graph or a directed graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_graph_or_digraph(path_graph(5));
(%o2)                         true
(%i3) is_graph_or_digraph(path_digraph(5));
(%o3)                         true
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fisomorphic"></a>Function: <strong>is_isomorphic</strong><em> (<var>gr1</var>, <var>gr2</var>)</em></dt>
<dd>
<p>Returns <code>true</code> if graphs/digraphs <var>gr1</var> and <var>gr2</var> are isomorphic
and <code>false</code> otherwise.
</p>
<p>See also <code>isomorphism</code>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) is_isomorphic(clk5, petersen_graph());
(%o3)                         true
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fplanar"></a>Function: <strong>is_planar</strong><em> (<var>gr</var>)</em></dt>
<dd>
<p>Returns <code>true</code> if <var>gr</var> is a planar graph and <code>false</code> otherwise.
</p>
<p>The algorithm used is the Demoucron&rsquo;s algorithm, which is a quadratic time
algorithm.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_planar(dodecahedron_graph());
(%o2)                         true
(%i3) is_planar(petersen_graph());
(%o3)                         false
(%i4) is_planar(petersen_graph(10,2));
(%o4)                         true
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fsconnected"></a>Function: <strong>is_sconnected</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if the directed graph <var>gr</var> is strongly connected and
<code>false</code> otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_sconnected(cycle_digraph(5));
(%o2)                         true
(%i3) is_sconnected(path_digraph(5));
(%o3)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005fvertex_005fin_005fgraph"></a>Function: <strong>is_vertex_in_graph</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>v</var> is a vertex in the graph <var>g</var> and <code>false</code>  otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_vertex_in_graph(0, c4);
(%o3)                         true
(%i4) is_vertex_in_graph(6, c4);
(%o4)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-is_005ftree"></a>Function: <strong>is_tree</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a tree and <code>false</code>  otherwise.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) is_tree(random_tree(4));
(%o2)                         true
(%i3) is_tree(graph_union(random_tree(4), random_tree(5)));
(%o3)                         false
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-laplacian_005fmatrix"></a>Function: <strong>laplacian_matrix</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the laplacian matrix of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) laplacian_matrix(cycle_graph(5));
                   [  2   - 1   0    0   - 1 ]
                   [                         ]
                   [ - 1   2   - 1   0    0  ]
                   [                         ]
(%o2)              [  0   - 1   2   - 1   0  ]
                   [                         ]
                   [  0    0   - 1   2   - 1 ]
                   [                         ]
                   [ - 1   0    0   - 1   2  ]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-max_005fclique"></a>Function: <strong>max_clique</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns a maximum clique of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.5)$
(%i3) max_clique(g);
(%o3)          [6, 12, 31, 36, 52, 59, 62, 63, 80]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-max_005fdegree"></a>Function: <strong>max_degree</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the maximal degree of vertices of the graph <var>gr</var> and a
vertex of maximal degree.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.02)$
(%i3) max_degree(g);
(%o3)                        [6, 79]
(%i4) vertex_degree(95, g);
(%o4)                           2
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-max_005fflow"></a>Function: <strong>max_flow</strong><em> (<var>net</var>, <var>s</var>, <var>t</var>)</em></dt>
<dd><p>Returns a maximum flow through the network <var>net</var> with the source
<var>s</var> and the sink <var>t</var>.
</p>
<p>The function returns the value of the maximal flow and a list
representing the weights of the arcs in the optimal flow.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) net : create_graph(
  [1,2,3,4,5,6],
  [[[1,2], 1.0],
   [[1,3], 0.3],
   [[2,4], 0.2],
   [[2,5], 0.3],
   [[3,4], 0.1],
   [[3,5], 0.1],
   [[4,6], 1.0],
   [[5,6], 1.0]],
  directed=true)$
(%i3) [flow_value, flow] : max_flow(net, 1, 6);
(%o3) [0.7, [[[1, 2], 0.5], [[1, 3], 0.2], [[2, 4], 0.2], 
[[2, 5], 0.3], [[3, 4], 0.1], [[3, 5], 0.1], [[4, 6], 0.3], 
[[5, 6], 0.4]]]
(%i4) fl : 0$
(%i5) for u in out_neighbors(1, net)
     do fl : fl + assoc([1, u], flow)$
(%i6) fl;
(%o6)                          0.7
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-max_005findependent_005fset"></a>Function: <strong>max_independent_set</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns a maximum independent set of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) mi : max_independent_set(d);
(%o3)             [0, 3, 5, 9, 10, 11, 18, 19]
(%i4) draw_graph(d, show_vertices=mi)$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs05.gif" alt="figures/graphs05">

<dl>
<dt><a name="index-max_005fmatching"></a>Function: <strong>max_matching</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns a maximum matching of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) m : max_matching(d);
(%o3) [[5, 7], [8, 9], [6, 10], [14, 19], [13, 18], [12, 17], 
                               [11, 16], [0, 15], [3, 4], [1, 2]]
(%i4) draw_graph(d, show_edges=m)$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs06.gif" alt="figures/graphs06">

<dl>
<dt><a name="index-min_005fdegree"></a>Function: <strong>min_degree</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the minimum degree of vertices of the graph <var>gr</var> and a
vertex of minimum degree.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.1)$
(%i3) min_degree(g);
(%o3)                        [3, 49]
(%i4) vertex_degree(21, g);
(%o4)                           9
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-min_005fedge_005fcut"></a>Function: <strong>min_edge_cut</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the minimum edge cut in the graph <var>gr</var>.
</p>
<p>See also <code>edge_connectivity</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-min_005fvertex_005fcover"></a>Function: <strong>min_vertex_cover</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the minimum vertex cover of the graph <var>gr</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-min_005fvertex_005fcut"></a>Function: <strong>min_vertex_cut</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the minimum vertex cut in the graph <var>gr</var>.
</p>
<p>See also <code>vertex_connectivity</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-minimum_005fspanning_005ftree"></a>Function: <strong>minimum_spanning_tree</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the minimum spanning tree of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(path_graph(10), path_graph(10))$
(%i3) t : minimum_spanning_tree(g)$
(%i4) draw_graph(g, show_edges=edges(t))$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs07.gif" alt="figures/graphs07">

<dl>
<dt><a name="index-neighbors"></a>Function: <strong>neighbors</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the list of neighbors of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) neighbors(3, p);
(%o3)                       [4, 8, 2]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-odd_005fgirth"></a>Function: <strong>odd_girth</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the length of the shortest odd cycle in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(cycle_graph(4), cycle_graph(7))$
(%i3) girth(g);
(%o3)                           4
(%i4) odd_girth(g);
(%o4)                           7
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-out_005fneighbors"></a>Function: <strong>out_neighbors</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the list of out-neighbors of the vertex <var>v</var> in the directed
graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                          [1]
(%i4) out_neighbors(2, p);
(%o4)                          []
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-planar_005fembedding"></a>Function: <strong>planar_embedding</strong><em> (<var>gr</var>)</em></dt>
<dd>
<p>Returns the list of facial walks in a planar embedding of <var>gr</var> and
<code>false</code> if <var>gr</var> is not a planar graph.
</p>
<p>The graph <var>gr</var> must be biconnected.
</p>
<p>The algorithm used is the Demoucron&rsquo;s algorithm, which is a quadratic time
algorithm.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) planar_embedding(grid_graph(3,3));
(%o2) [[3, 6, 7, 8, 5, 2, 1, 0], [4, 3, 0, 1], [3, 4, 7, 6], 
                                      [8, 7, 4, 5], [1, 2, 5, 4]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-print_005fgraph"></a>Function: <strong>print_graph</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Prints some information about the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) print_graph(c5)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  0  3
  3 :  4  2
  2 :  3  1
  1 :  2  0
  0 :  4  1
(%i4) dc5 : cycle_digraph(5)$
(%i5) print_graph(dc5)$
Digraph on 5 vertices with 5 arcs.
Adjacencies:
  4 :  0
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i6) out_neighbors(0, dc5);
(%o6)                          [1]
</pre></div>

<p>@opencatbox
@category{Package graphs}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-radius"></a>Function: <strong>radius</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the radius of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) radius(dodecahedron_graph());
(%o2)                           5
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-set_005fedge_005fweight"></a>Function: <strong>set_edge_weight</strong><em> (<var>e</var>, <var>w</var>, <var>gr</var>)</em></dt>
<dd><p>Assigns the weight <var>w</var> to the edge <var>e</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1, 2], [[[1,2], 1.2]])$
(%i3) get_edge_weight([1,2], g);
(%o3)                          1.2
(%i4) set_edge_weight([1,2], 2.1, g);
(%o4)                         done
(%i5) get_edge_weight([1,2], g);
(%o5)                          2.1
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-set_005fvertex_005flabel"></a>Function: <strong>set_vertex_label</strong><em> (<var>v</var>, <var>l</var>, <var>gr</var>)</em></dt>
<dd><p>Assigns the label <var>l</var> to the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[1, &quot;One&quot;], [2, &quot;Two&quot;]], [[1,2]])$
(%i3) get_vertex_label(1, g);
(%o3)                          One
(%i4) set_vertex_label(1, &quot;oNE&quot;, g);
(%o4)                         done
(%i5) get_vertex_label(1, g);
(%o5)                          oNE
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-shortest_005fpath"></a>Function: <strong>shortest_path</strong><em> (<var>u</var>, <var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the shortest path from <var>u</var> to <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) path : shortest_path(0, 7, d);
(%o3)                   [0, 1, 19, 13, 7]
(%i4) draw_graph(d, show_edges=vertices_to_path(path))$
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<img src="figures/graphs08.gif" alt="figures/graphs08">

<dl>
<dt><a name="index-shortest_005fweighted_005fpath"></a>Function: <strong>shortest_weighted_path</strong><em> (<var>u</var>, <var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the length of the shortest weighted path and the shortest
weighted path from <var>u</var> to <var>v</var> in the graph <var>gr</var>.
</p>
<p>The length of a weighted path is the sum of edge weights of edges in the
path. If an edge has no weight, then it has a default weight 1.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g: petersen_graph(20, 2)$
(%i3) for e in edges(g) do set_edge_weight(e, random(1.0), g)$
(%i4) shortest_weighted_path(0, 10, g);
(%o4) [2.575143920268482, [0, 20, 38, 36, 34, 32, 30, 10]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-strong_005fcomponents"></a>Function: <strong>strong_components</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the strong components of a directed graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(4)$
(%i3) strong_components(t);
(%o3)                 [[1], [0], [2], [3]]
(%i4) vertex_out_degree(3, t);
(%o4)                           3
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-topological_005fsort"></a>Function: <strong>topological_sort</strong><em> (<var>dag</var>)</em></dt>
<dd>
<p>Returns a topological sorting of the vertices of a directed graph
<var>dag</var> or an empty list if <var>dag</var> is not a directed acyclic graph.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(
         [1,2,3,4,5],
         [
          [1,2], [2,5], [5,3],
          [5,4], [3,4], [1,3]
         ],
         directed=true)$
(%i3) topological_sort(g);
(%o3)                    [1, 2, 5, 3, 4]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fconnectivity"></a>Function: <strong>vertex_connectivity</strong><em> (<var>g</var>)</em></dt>
<dd><p>Returns the vertex connectivity of the graph <var>g</var>.
</p>
<p>See also <code>min_vertex_cut</code>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fdegree"></a>Function: <strong>vertex_degree</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the degree of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fdistance"></a>Function: <strong>vertex_distance</strong><em> (<var>u</var>, <var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the length of the shortest path between <var>u</var> and <var>v</var> in
the (directed) graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) vertex_distance(0, 7, d);
(%o3)                           4
(%i4) shortest_path(0, 7, d);
(%o4)                   [0, 1, 19, 13, 7]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005feccentricity"></a>Function: <strong>vertex_eccentricity</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd>
<p>Returns the eccentricity of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) g:cycle_graph(7)$
(%i3) vertex_eccentricity(0, g);
(%o3)                           3
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fin_005fdegree"></a>Function: <strong>vertex_in_degree</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the in-degree of the vertex <var>v</var> in the directed graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p5 : path_digraph(5)$
(%i3) print_graph(p5)$
Digraph on 5 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i4) vertex_in_degree(4, p5);
(%o4)                           1
(%i5) in_neighbors(4, p5);
(%o5)                          [3]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fout_005fdegree"></a>Function: <strong>vertex_out_degree</strong><em> (<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Returns the out-degree of the vertex <var>v</var> in the directed graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(10)$
(%i3) vertex_out_degree(0, t);
(%o3)                           2
(%i4) out_neighbors(0, t);
(%o4)                        [7, 1]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertices"></a>Function: <strong>vertices</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the list of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) vertices(complete_graph(4));
(%o2)                     [3, 2, 1, 0]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-vertex_005fcoloring"></a>Function: <strong>vertex_coloring</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns an optimal coloring of the vertices of the graph <var>gr</var>.
</p>
<p>The function returns the chromatic number and a list representing the
coloring of the vertices of <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i1) load (graphs)$
(%i2) p:petersen_graph()$
(%i3) vertex_coloring(p);
(%o3) [3, [[0, 2], [1, 3], [2, 2], [3, 3], [4, 1], [5, 3], 
                                 [6, 1], [7, 1], [8, 2], [9, 2]]]
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<dl>
<dt><a name="index-wiener_005findex"></a>Function: <strong>wiener_index</strong><em> (<var>gr</var>)</em></dt>
<dd><p>Returns the Wiener index of the graph <var>gr</var>.
</p>
<p>Example:
</p><div class="example">
<pre class="example">(%i2) wiener_index(dodecahedron_graph());
(%o2)                          500
</pre></div>

<p>@opencatbox
@category{Package graphs} @category{Package graphs - properties}
@closecatbox
</p></dd></dl>

<hr>
