<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on January, 6 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima VERSION Manual: 9. Simplification</title>

<meta name="description" content="Maxima VERSION Manual: 9. Simplification">
<meta name="keywords" content="Maxima VERSION Manual: 9. Simplification">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="en" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Simplification"></a>
<a name="SEC45"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_8.html#SEC44" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC46" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_8.html#SEC43" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC47" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 9. Simplification </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC46">9.1 Functions and Variables for Simplification</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<p><a name="Item_003a-Functions-and-Variables-for-Simplification"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-Simplification"></a>
<a name="SEC46"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC45" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC47" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC45" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC45" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC47" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 9.1 Functions and Variables for Simplification </h2>

<p><a name="additive"></a>
<a name="Item_003a-additive"></a>
</p><dl>
<dt><u>Property:</u> <b>additive</b>
<a name="IDX288"></a>
</dt>
<dd><p>If <code>declare(f,additive)</code> has been executed, then:
</p>
<p>(1) If <code>f</code> is univariate, whenever the simplifier encounters <code>f</code>
applied to a sum, <code>f</code> will be distributed over that sum.  I.e.
<code>f(y+x)</code> will simplify to <code>f(y)+f(x)</code>.
</p>
<p>(2) If <code>f</code> is a function of 2 or more arguments, additivity is defined as
additivity in the first argument to <code>f</code>, as in the case of <code>sum</code> or
<code>integrate</code>, i.e.  <code>f(h(x)+g(x),x)</code> will simplify to
<code>f(h(x),x)+f(g(x),x)</code>.  This simplification does not occur when <code>f</code> is
applied to expressions of the form <code>sum(x[i],i,lower-limit,upper-limit)</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) F3 (a + b + c);
(%o1)                     F3(c + b + a)
(%i2) declare (F3, additive);
(%o2)                         done
(%i3) F3 (a + b + c);
(%o3)                 F3(c) + F3(b) + F3(a)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</p>
</div>

</dd></dl>

<p><a name="antisymmetric"></a>
<a name="Item_003a-antisymmetric"></a>
</p><dl>
<dt><u>Property:</u> <b>antisymmetric</b>
<a name="IDX289"></a>
</dt>
<dd><p>If <code>declare(h,antisymmetric)</code> is done, this tells the simplifier that
<code>h</code> is antisymmetric.  E.g.  <code>h(x,z,y)</code> will simplify to 
<code>- h(x, y, z)</code>.  That is, it will give (-1)^n times the result given by
<code>symmetric</code> or <code>commutative</code>, where n is the number of interchanges
of two arguments necessary to convert it to that form.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) S (b, a);
(%o1)                        S(b, a)
(%i2) declare (S, symmetric);
(%o2)                         done
(%i3) S (b, a);
(%o3)                        S(a, b)
(%i4) S (a, c, e, d, b);
(%o4)                   S(a, b, c, d, e)
(%i5) T (b, a);
(%o5)                        T(b, a)
(%i6) declare (T, antisymmetric);
(%o6)                         done
(%i7) T (b, a);
(%o7)                       - T(a, b)
(%i8) T (a, c, e, d, b);
(%o8)                   T(a, b, c, d, e)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</p>
</div>

</dd></dl>

<p><a name="Item_003a-combine"></a>
</p><dl>
<dt><u>Function:</u> <b>combine</b><i> (<var>expr</var>)</i>
<a name="IDX290"></a>
</dt>
<dd><p>Simplifies the sum <var>expr</var> by combining terms with the same
denominator into a single term.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="commutative"></a>
<a name="Item_003a-commutative"></a>
</p><dl>
<dt><u>Property:</u> <b>commutative</b>
<a name="IDX291"></a>
</dt>
<dd><p>If <code>declare(h, commutative)</code> is done, this tells the simplifier that
<code>h</code> is a commutative function.  E.g.  <code>h(x, z, y)</code> will simplify to
<code>h(x, y, z)</code>.  This is the same as <code>symmetric</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</p>
</div>

</dd></dl>


<p><a name="demoivre"></a>
<a name="Item_003a-demoivre"></a>
</p><dl>
<dt><u>Function:</u> <b>demoivre</b><i> (<var>expr</var>)</i>
<a name="IDX292"></a>
</dt>
<dt><u>Option variable:</u> <b>demoivre</b>
<a name="IDX293"></a>
</dt>
<dd><p>The function <code>demoivre (expr)</code> converts one expression
without setting the global variable <code>demoivre</code>.
</p>
<p>When the variable <code>demoivre</code> is <code>true</code>, complex exponentials are
converted into equivalent expressions in terms of circular functions:
<code>exp (a + b*%i)</code> simplifies to <code>%e^a * (cos(b) + %i*sin(b))</code>
if <code>b</code> is free of <code>%i</code>.  <code>a</code> and <code>b</code> are not expanded.
</p>
<p>The default value of <code>demoivre</code> is <code>false</code>.
</p>
<p><code>exponentialize</code> converts circular and hyperbolic functions to exponential
form.  <code>demoivre</code> and <code>exponentialize</code> cannot both be true at the same
time.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Complex-variables">Complex variables</a>
 &middot;
<a href="maxima_99.html#Category_003a-Trigonometric-functions">Trigonometric functions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Hyperbolic-functions">Hyperbolic functions</a>
</p>
</div>

</dd></dl>


<p><a name="function_005fdistrib"></a>
<a name="Item_003a-distrib"></a>
</p><dl>
<dt><u>Function:</u> <b>distrib</b><i> (<var>expr</var>)</i>
<a name="IDX294"></a>
</dt>
<dd><p>Distributes sums over products.  It differs from <code>expand</code> in that it works
at only the top level of an expression, i.e., it doesn't recurse and it is
faster than <code>expand</code>.  It differs from <code>multthru</code> in that it expands
all sums at that level.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) distrib ((a+b) * (c+d));
(%o1)                 b d + a d + b c + a c
(%i2) multthru ((a+b) * (c+d));
(%o2)                 (b + a) d + (b + a) c
(%i3) distrib (1/((a+b) * (c+d)));
                                1
(%o3)                    ---------------
                         (b + a) (d + c)
(%i4) expand (1/((a+b) * (c+d)), 1, 0);
                                1
(%o4)                 ---------------------
                      b d + a d + b c + a c
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="distribute_005fover"></a>
<a name="Item_003a-distribute_005fover"></a>
</p><dl>
<dt><u>Option variable:</u> <b>distribute_over</b>
<a name="IDX295"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p><code>distribute_over</code> controls the mapping of functions over bags like lists, 
matrices, and equations.  At this time not all Maxima functions have this 
property.  It is possible to look up this property with the command
<code>properties</code>.
</p>
<p>The mapping of functions is switched off, when setting <code>distribute_over</code> 
to the value <code>false</code>.
</p>
<p>Examples:
</p>
<p>The <code>sin</code> function maps over a list:
</p>
<pre class="example">(%i1) sin([x,1,1.0]);
(%o1)                 [sin(x), sin(1), .8414709848078965]
</pre>
<p><code>mod</code> is a function with two arguments which maps over lists.  Mapping over 
nested lists is possible too:
</p>
<pre class="example">(%i2) mod([x,11,2*a],10);
(%o2)                    [mod(x, 10), 1, 2 mod(a, 5)]
(%i3) mod([[x,y,z],11,2*a],10);
(%o3)       [[mod(x, 10), mod(y, 10), mod(z, 10)], 1, 2 mod(a, 5)]
</pre>
<p>Mapping of the <code>floor</code> function over a matrix and an equation:
</p>
<pre class="example">(%i4) floor(matrix([a,b],[c,d]));
                            [ floor(a)  floor(b) ]
(%o4)                       [                    ]
                            [ floor(c)  floor(d) ]
(%i5) floor(a=b);
(%o5)                         floor(a) = floor(b)
</pre>
<p>Functions with more than one argument map over any of the arguments or all
arguments:
</p>
<pre class="example">(%i6) expintegral_e([1,2],[x,y]);
(%o6) [[expintegral_e(1, x), expintegral_e(1, y)], 
       [expintegral_e(2, x), expintegral_e(2, y)]]
</pre>
<p>Check if a function has the property distribute_over:
</p>
<pre class="example">(%i7) properties(abs);
(%o7) [integral, distributes over bags, noun, rule, gradef]
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-flags-and-variables">Simplification flags and variables</a>
</p>
</div>

</dd></dl>

<p><a name="domain"></a>
<a name="Item_003a-domain"></a>
</p><dl>
<dt><u>Option variable:</u> <b>domain</b>
<a name="IDX296"></a>
</dt>
<dd><p>Default value: <code>real</code>
</p>
<p>When <code>domain</code> is set to <code>complex</code>, <code>sqrt (x^2)</code> will remain
<code>sqrt (x^2)</code> instead of returning <code>abs(x)</code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-flags-and-variables">Simplification flags and variables</a>
</p>
</div>

</dd></dl>

<p><a name="evenfun"></a>
<a name="oddfun"></a>
<a name="Item_003a-evenfun"></a>
</p><dl>
<dt><u>Property:</u> <b>evenfun</b>
<a name="IDX297"></a>
</dt>
<dt><u>Property:</u> <b>oddfun</b>
<a name="IDX298"></a>
</dt>
<dd><p><code>declare(f, evenfun</code> or <code>declare(f, oddfun</code> tells Maxima to recognize
the function <code>f</code> as an even or odd function.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) o (- x) + o (x);
(%o1)                     o(x) + o(- x)
(%i2) declare (o, oddfun);
(%o2)                         done
(%i3) o (- x) + o (x);
(%o3)                           0
(%i4) e (- x) - e (x);
(%o4)                     e(- x) - e(x)
(%i5) declare (e, evenfun);
(%o5)                         done
(%i6) e (- x) - e (x);
(%o6)                           0
</pre></dd></dl>

<p><a name="expand"></a>
<a name="Item_003a-expand"></a>
</p><dl>
<dt><u>Function:</u> <b>expand</b><i> (<var>expr</var>)</i>
<a name="IDX299"></a>
</dt>
<dt><u>Function:</u> <b>expand</b><i> (<var>expr</var>, <var>p</var>, <var>n</var>)</i>
<a name="IDX300"></a>
</dt>
<dd><p>Expand expression <var>expr</var>.
Products of sums and exponentiated sums are
multiplied out, numerators of rational expressions which are sums are
split into their respective terms, and multiplication (commutative
and non-commutative) are distributed over addition at all levels of
<var>expr</var>.
</p>
<p>For polynomials one should usually use <code>ratexpand</code> which uses a
more efficient algorithm.
</p>
<p><code>maxnegex</code> and <code>maxposex</code> control the maximum negative and
positive exponents, respectively, which will expand.
</p>
<p><code>expand (<var>expr</var>, <var>p</var>, <var>n</var>)</code> expands <var>expr</var>, 
using <var>p</var> for <code>maxposex</code> and <var>n</var> for <code>maxnegex</code>.
This is useful in order to expand part but not all of an expression.
</p>
<p><code>expon</code> - the exponent of the largest negative power which is
automatically expanded (independent of calls to <code>expand</code>).  For example
if <code>expon</code> is 4 then <code>(x+1)^(-5)</code> will not be automatically expanded.
</p>
<p><code>expop</code> - the highest positive exponent which is automatically expanded.
Thus <code>(x+1)^3</code>, when typed, will be automatically expanded only if
<code>expop</code> is greater than or equal to 3.  If it is desired to have
<code>(x+1)^n</code> expanded where <code>n</code> is greater than <code>expop</code> then
executing <code>expand ((x+1)^n)</code> will work only if <code>maxposex</code> is not
less than <code>n</code>.
</p>
<p><code>expand(expr, 0, 0)</code> causes a resimplification of <code>expr</code>.  <code>expr</code>
is not reevaluated.  In distinction from <code>ev(expr, noeval)</code> a special
representation (e. g. a CRE form) is removed.  See also <code>ev</code>.
</p>
<p>The <code>expand</code> flag used with <code>ev</code> causes expansion.
</p>
<p>The file <tt>`share/simplification/facexp.mac'</tt>
contains several related functions (in particular <code>facsum</code>,
<code>factorfacsum</code> and <code>collectterms</code>, which are autoloaded) and variables
(<code>nextlayerfactor</code> and <code>facsum_combine</code>) that provide the user with
the ability to structure expressions by controlled expansion.
Brief function descriptions are available in <tt>`simplification/facexp.usg'</tt>.
A demo is available by doing <code>demo(&quot;facexp&quot;)</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) expr:(x+1)^2*(y+1)^3;
                               2        3
(%o1)                   (x + 1)  (y + 1)
(%i2) expand(expr);
       2  3        3    3      2  2        2      2      2
(%o2) x  y  + 2 x y  + y  + 3 x  y  + 6 x y  + 3 y  + 3 x  y
                                                      2
                                     + 6 x y + 3 y + x  + 2 x + 1
(%i3) expand(expr,2);
               2        3              3          3
(%o3)         x  (y + 1)  + 2 x (y + 1)  + (y + 1)
(%i4) expr:(x+1)^-2*(y+1)^3;
                                   3
                            (y + 1)
(%o4)                       --------
                                   2
                            (x + 1)
(%i5) expand(expr);
            3               2
           y             3 y            3 y             1
(%o5) ------------ + ------------ + ------------ + ------------
       2              2              2              2
      x  + 2 x + 1   x  + 2 x + 1   x  + 2 x + 1   x  + 2 x + 1
(%i6) expand(expr,2,2);
                                   3
                            (y + 1)
(%o6)                     ------------
                           2
                          x  + 2 x + 1
</pre>
<p>Resimplify an expression without expansion:
</p>
<pre class="example">(%i7) expr:(1+x)^2*sin(x);
                                       2
(%o7)                           (x + 1)  sin(x)
(%i8) exponentialize:true;
(%o8)                                true
(%i9) expand(expr,0,0);
                                   2    %i x     - %i x
                         %i (x + 1)  (%e     - %e      )
(%o9)                  - -------------------------------
                                        2
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="expandwrt"></a>
<a name="Item_003a-expandwrt"></a>
</p><dl>
<dt><u>Function:</u> <b>expandwrt</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX301"></a>
</dt>
<dd><p>Expands expression <code>expr</code> with respect to the 
variables <var>x_1</var>, &hellip;, <var>x_n</var>.
All products involving the variables appear explicitly.  The form returned
will be free of products of sums of expressions that are not free of
the variables.  <var>x_1</var>, &hellip;, <var>x_n</var>
may be variables, operators, or expressions.
</p>
<p>By default, denominators are not expanded, but this can be controlled by
means of the switch <code>expandwrt_denom</code>.
</p>
<p>This function is autoloaded from
<tt>`simplification/stopex.mac'</tt>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="expandwert_005fdenom"></a>
<a name="Item_003a-expandwrt_005fdenom"></a>
</p><dl>
<dt><u>Option variable:</u> <b>expandwrt_denom</b>
<a name="IDX302"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>expandwrt_denom</code> controls the treatment of rational
expressions by <code>expandwrt</code>.  If <code>true</code>, then both the numerator and
denominator of the expression will be expanded according to the
arguments of <code>expandwrt</code>, but if <code>expandwrt_denom</code> is <code>false</code>,
then only the numerator will be expanded in that way.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="expandwrt_005ffactored"></a>
<a name="Item_003a-expandwrt_005ffactored"></a>
</p><dl>
<dt><u>Function:</u> <b>expandwrt_factored</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX303"></a>
</dt>
<dd><p>is similar to <code>expandwrt</code>, but treats expressions that are products
somewhat differently.  <code>expandwrt_factored</code> expands only on those factors
of <code>expr</code> that contain the variables <var>x_1</var>, &hellip;, <var>x_n</var>.
</p>
<p>This function is autoloaded from <tt>`simplification/stopex.mac'</tt>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="expon"></a>
<a name="Item_003a-expon"></a>
</p><dl>
<dt><u>Option variable:</u> <b>expon</b>
<a name="IDX304"></a>
</dt>
<dd><p>Default value: 0
</p>
<p><code>expon</code> is the exponent of the largest negative power which
is automatically expanded (independent of calls to <code>expand</code>).  For
example, if <code>expon</code> is 4 then <code>(x+1)^(-5)</code> will not be automatically
expanded.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="exponentialize"></a>
<a name="Item_003a-exponentialize"></a>
</p><dl>
<dt><u>Function:</u> <b>exponentialize</b><i> (<var>expr</var>)</i>
<a name="IDX305"></a>
</dt>
<dt><u>Option variable:</u> <b>exponentialize</b>
<a name="IDX306"></a>
</dt>
<dd><p>The function <code>exponentialize (expr)</code> converts 
circular and hyperbolic functions in <var>expr</var> to exponentials,
without setting the global variable <code>exponentialize</code>.
</p>
<p>When the variable <code>exponentialize</code> is <code>true</code>,
all circular and hyperbolic functions are converted to exponential form.
The default value is <code>false</code>.
</p>
<p><code>demoivre</code> converts complex exponentials into circular functions.
<code>exponentialize</code> and <code>demoivre</code> cannot
both be true at the same time.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Complex-variables">Complex variables</a>
 &middot;
<a href="maxima_99.html#Category_003a-Trigonometric-functions">Trigonometric functions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Hyperbolic-functions">Hyperbolic functions</a>
</p>
</div>

</dd></dl>


<p><a name="expop"></a>
<a name="Item_003a-expop"></a>
</p><dl>
<dt><u>Option variable:</u> <b>expop</b>
<a name="IDX307"></a>
</dt>
<dd><p>Default value: 0
</p>
<p><code>expop</code> is the highest positive exponent which is automatically expanded.
Thus <code>(x + 1)^3</code>, when typed, will be automatically expanded only if
<code>expop</code> is greater than or equal to 3.  If it is desired to have
<code>(x + 1)^n</code> expanded where <code>n</code> is greater than <code>expop</code> then
executing <code>expand ((x + 1)^n)</code> will work only if <code>maxposex</code> is not
less than n.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="lassociative"></a>
<a name="Item_003a-lassociative"></a>
</p><dl>
<dt><u>Property:</u> <b>lassociative</b>
<a name="IDX308"></a>
</dt>
<dd><p><code>declare (g, lassociative)</code> tells the Maxima simplifier that <code>g</code> is
left-associative.  E.g., <code>g (g (a, b), g (c, d))</code> will simplify to
<code>g (g (g (a, b), c), d)</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Simplification">Simplification</a>
</p>
</div>

</dd></dl>


<p><a name="linear"></a>
<a name="Item_003a-linear"></a>
</p><dl>
<dt><u>Property:</u> <b>linear</b>
<a name="IDX309"></a>
</dt>
<dd><p>One of Maxima's operator properties.  For univariate <code>f</code> so
declared, &quot;expansion&quot; <code>f(x + y)</code> yields <code>f(x) + f(y)</code>,
<code>f(a*x)</code> yields <code>a*f(x)</code> takes
place where <code>a</code> is a &quot;constant&quot;.  For functions of two or more arguments,
&quot;linearity&quot; is defined to be as in the case of <code>sum</code> or <code>integrate</code>,
i.e., <code>f (a*x + b, x)</code> yields <code>a*f(x,x) + b*f(1,x)</code>
for <code>a</code> and <code>b</code> free of <code>x</code>.
</p>
<p><code>linear</code> is equivalent to <code>additive</code> and <code>outative</code>.
See also <code>opproperties</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) 'sum (F(k) + G(k), k, 1, inf);
                       inf
                       ====
                       \
(%o1)                   &gt;    (G(k) + F(k))
                       /
                       ====
                       k = 1
(%i2) declare (nounify (sum), linear);
(%o2)                         done
(%i3) 'sum (F(k) + G(k), k, 1, inf);
                     inf          inf
                     ====         ====
                     \            \
(%o3)                 &gt;    G(k) +  &gt;    F(k)
                     /            /
                     ====         ====
                     k = 1        k = 1
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Simplification">Simplification</a>
</p>
</div>

</dd></dl>


<p><a name="maxnegex"></a>
<a name="Item_003a-maxnegex"></a>
</p><dl>
<dt><u>Option variable:</u> <b>maxnegex</b>
<a name="IDX310"></a>
</dt>
<dd><p>Default value: 1000
</p>
<p><code>maxnegex</code> is the largest negative exponent which will
be expanded by the <code>expand</code> command (see also <code>maxposex</code>).
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="maxposex"></a>
<a name="Item_003a-maxposex"></a>
</p><dl>
<dt><u>Option variable:</u> <b>maxposex</b>
<a name="IDX311"></a>
</dt>
<dd><p>Default value: 1000
</p>
<p><code>maxposex</code> is the largest exponent which will be
expanded with the <code>expand</code> command (see also <code>maxnegex</code>).
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="multiplicative"></a>
<a name="Item_003a-multiplicative"></a>
</p><dl>
<dt><u>Property:</u> <b>multiplicative</b>
<a name="IDX312"></a>
</dt>
<dd><p><code>declare(f, multiplicative)</code> tells the Maxima simplifier that <code>f</code>
is multiplicative.
</p>
<ol>
<li>
If <code>f</code> is univariate, whenever the simplifier encounters <code>f</code> applied
to a product, <code>f</code> distributes over that product.  E.g., <code>f(x*y)</code>
simplifies to <code>f(x)*f(y)</code>.
</li><li>
If <code>f</code> is a function of 2 or more arguments, multiplicativity is
defined as multiplicativity in the first argument to <code>f</code>, e.g.,
<code>f (g(x) * h(x), x)</code> simplifies to <code>f (g(x) ,x) * f (h(x), x)</code>.
</li></ol>

<p>This simplification does not occur when <code>f</code> is applied to expressions of
the form <code>product (x[i], i, m, n)</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) F2 (a * b * c);
(%o1)                       F2(a b c)
(%i2) declare (F2, multiplicative);
(%o2)                         done
(%i3) F2 (a * b * c);
(%o3)                   F2(a) F2(b) F2(c)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Simplification">Simplification</a>
</p>
</div>

</dd></dl>


<p><a name="multthru"></a>
<a name="Item_003a-multthru"></a>
</p><dl>
<dt><u>Function:</u> <b>multthru</b><i> (<var>expr</var>)</i>
<a name="IDX313"></a>
</dt>
<dt><u>Function:</u> <b>multthru</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX314"></a>
</dt>
<dd><p>Multiplies a factor (which should be a sum) of <var>expr</var> by the other factors
of <var>expr</var>.  That is, <var>expr</var> is <code><var>f_1</var> <var>f_2</var> ... <var>f_n</var></code>
where at least one factor, say <var>f_i</var>, is a sum of terms.  Each term in that
sum is multiplied by the other factors in the product.  (Namely all the factors
except <var>f_i</var>).  <code>multthru</code> does not expand exponentiated sums.
This function is the fastest way to distribute products (commutative or
noncommutative) over sums.  Since quotients are represented as products
<code>multthru</code> can be used to divide sums by products as well.
</p>
<p><code>multthru (<var>expr_1</var>, <var>expr_2</var>)</code> multiplies each term in
<var>expr_2</var> (which should be a sum or an equation) by <var>expr_1</var>.  If
<var>expr_1</var> is not itself a sum then this form is equivalent to
<code>multthru (<var>expr_1</var>*<var>expr_2</var>)</code>.
</p>
<pre class="example">(%i1) x/(x-y)^2 - 1/(x-y) - f(x)/(x-y)^3;
                      1        x         f(x)
(%o1)             - ----- + -------- - --------
                    x - y          2          3
                            (x - y)    (x - y)
(%i2) multthru ((x-y)^3, %);
                           2
(%o2)             - (x - y)  + x (x - y) - f(x)
(%i3) ratexpand (%);
                           2
(%o3)                   - y  + x y - f(x)
(%i4) ((a+b)^10*s^2 + 2*a*b*s + (a*b)^2)/(a*b*s^2);
                        10  2              2  2
                 (b + a)   s  + 2 a b s + a  b
(%o4)            ------------------------------
                                  2
                             a b s
(%i5) multthru (%);  /* note that this does not expand (b+a)^10 */
                                        10
                       2   a b   (b + a)
(%o5)                  - + --- + ---------
                       s    2       a b
                           s
(%i6) multthru (a.(b+c.(d+e)+f));
(%o6)            a . f + a . c . (e + d) + a . b
(%i7) expand (a.(b+c.(d+e)+f));
(%o7)         a . f + a . c . e + a . c . d + a . b
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="property_005fnary"></a>
</p>
<dl>
<dt><u>Property:</u> <b>nary</b>
<a name="IDX315"></a>
</dt>
<dd><p><code>declare(f, nary)</code> tells Maxima to recognize the function <code>f</code> as an
n-ary function.
</p>
<p>The <code>nary</code> declaration is not the same as calling the
<code><a href="maxima_7.html#function_005fnary">nary</a></code>
 function.  The sole effect of
<code>declare(f, nary)</code> is to instruct the Maxima simplifier to flatten nested
expressions, for example, to simplify <code>foo(x, foo(y, z))</code> to
<code>foo(x, y, z)</code>.  See also <code><a href="maxima_11.html#declare">declare</a></code>.
</p>

<p>Example:
</p>
<pre class="example">(%i1) H (H (a, b), H (c, H (d, e)));
(%o1)               H(H(a, b), H(c, H(d, e)))
(%i2) declare (H, nary);
(%o2)                         done
(%i3) H (H (a, b), H (c, H (d, e)));
(%o3)                   H(a, b, c, d, e)
</pre></dd></dl>


<p><a name="negdistrib"></a>
<a name="Item_003a-negdistrib"></a>
</p><dl>
<dt><u>Option variable:</u> <b>negdistrib</b>
<a name="IDX316"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>negdistrib</code> is <code>true</code>, -1 distributes over an expression.
E.g., <code>-(x + y)</code> becomes <code>- y - x</code>.  Setting it to <code>false</code>
will allow <code>- (x + y)</code> to be displayed like that.  This is sometimes useful
but be very careful: like the <code>simp</code> flag, this is one flag you do not
want to set to <code>false</code> as a matter of course or necessarily for other
than local use in your Maxima.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-flags-and-variables">Simplification flags and variables</a>
</p>
</div>

</dd></dl>

<p><a name="opproperties"></a>
<a name="Item_003a-opproperties"></a>
</p><dl>
<dt><u>System variable:</u> <b>opproperties</b>
<a name="IDX317"></a>
</dt>
<dd><p><code>opproperties</code> is the list of the special operator properties recognized
by the Maxima simplifier:
<code>linear</code>, <code>additive</code>, <code>multiplicative</code>, <code>outative</code>,
<code>evenfun</code>, <code>oddfun</code>, <code>commutative</code>, <code>symmetric</code>,
<code>antisymmetric</code>, <code>nary</code>, <code>lassociative</code>, <code>rassociative</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Global-variables">Global variables</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
</p>
</div>

</dd></dl>


<p><a name="outative"></a>
<a name="Item_003a-outative"></a>
</p><dl>
<dt><u>Property:</u> <b>outative</b>
<a name="IDX318"></a>
</dt>
<dd><p><code>declare(f, outative)</code> tells the Maxima simplifier that constant factors
in the argument of <code>f</code> can be pulled out.
</p>
<ol>
<li>
If <code>f</code> is univariate, whenever the simplifier encounters <code>f</code> applied
to a product, that product will be partitioned into factors that are constant
and factors that are not and the constant factors will be pulled out.  E.g.,
<code>f(a*x)</code> will simplify to <code>a*f(x)</code> where <code>a</code> is a constant.
Non-atomic constant factors will not be pulled out.
</li><li>
If <code>f</code> is a function of 2 or more arguments, outativity is defined as in
the case of <code>sum</code> or <code>integrate</code>, i.e., <code>f (a*g(x), x)</code> will
simplify to <code>a * f(g(x), x)</code> for <code>a</code> free of <code>x</code>.
</li></ol>

<p><code>sum</code>, <code>integrate</code>, and <code>limit</code> are all <code>outative</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) F1 (100 * x);
(%o1)                       F1(100 x)
(%i2) declare (F1, outative);
(%o2)                         done
(%i3) F1 (100 * x);
(%o3)                       100 F1(x)
(%i4) declare (zz, constant);
(%o4)                         done
(%i5) F1 (zz * y);
(%o5)                       zz F1(y)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
</p>
</div>

</dd></dl>

<p><a name="radcan"></a>
<a name="Item_003a-radcan"></a>
</p><dl>
<dt><u>Function:</u> <b>radcan</b><i> (<var>expr</var>)</i>
<a name="IDX319"></a>
</dt>
<dd><p>Simplifies <var>expr</var>, which can contain logs, exponentials, and radicals, by 
converting it into a form which is canonical over a large class of expressions 
and a given ordering of variables; that is, all functionally equivalent forms 
are mapped into a unique form.  For a somewhat larger class of expressions, 
<code>radcan</code> produces a regular form.  Two equivalent expressions in this class 
do not necessarily have the same appearance, but their difference can be 
simplified by <code>radcan</code> to zero.
</p>
<p>For some expressions <code>radcan</code> is quite time consuming.  This is the cost 
of exploring certain relationships among the components of the expression for 
simplifications based on factoring and partial-fraction expansions of exponents.
</p>



<p>Examples:
</p>
<pre class="example">(%i1) radcan((log(x+x^2)-log(x))^a/log(1+x)^(a/2));
                                           a/2
(%o1)                            log(x + 1)

(%i2) radcan((log(1+2*a^x+a^(2*x))/log(1+a^x)));
(%o2)                                  2

(%i3) radcan((%e^x-1)/(1+%e^(x/2)));
                                     x/2
(%o3)                              %e    - 1
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-functions">Simplification functions</a>
</p>
</div>

</dd></dl>


<p><a name="radexpand"></a>
<a name="Item_003a-radexpand"></a>
</p><dl>
<dt><u>Option variable:</u> <b>radexpand</b>
<a name="IDX320"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p><code>radexpand</code> controls some simplifications of radicals.
</p>
<p>When <code>radexpand</code> is <code>all</code>, causes nth roots of factors of a product
which are powers of n to be pulled outside of the radical.  E.g. if
<code>radexpand</code> is <code>all</code>, <code>sqrt (16*x^2)</code> simplifies to <code>4*x</code>.
</p>
<p>More particularly, consider <code>sqrt (x^2)</code>.
</p><ul>
<li>
If <code>radexpand</code> is <code>all</code> or <code>assume (x &gt; 0)</code> has been executed, 
<code>sqrt(x^2)</code> simplifies to <code>x</code>.
</li><li>
If <code>radexpand</code> is <code>true</code> and <code>domain</code> is <code>real</code>
(its default), <code>sqrt(x^2)</code> simplifies to <code>abs(x)</code>.
</li><li>
If <code>radexpand</code> is <code>false</code>, or <code>radexpand</code> is <code>true</code> and
<code>domain</code> is <code>complex</code>, <code>sqrt(x^2)</code> is not simplified.
</li></ul>

<p>Note that <code>domain</code> only matters when <code>radexpand</code> is <code>true</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-flags-and-variables">Simplification flags and variables</a>
</p>
</div>

</dd></dl>


<p><a name="rassociative"></a>
<a name="Item_003a-rassociative"></a>
</p><dl>
<dt><u>Property:</u> <b>rassociative</b>
<a name="IDX321"></a>
</dt>
<dd><p><code>declare (g, rassociative)</code> tells the Maxima
simplifier that <code>g</code> is right-associative.  E.g.,
<code>g(g(a, b), g(c, d))</code> simplifies to <code>g(a, g(b, g(c, d)))</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
</p>
</div>

</dd></dl>


<p><a name="scsimp"></a>
<a name="Item_003a-scsimp"></a>
</p><dl>
<dt><u>Function:</u> <b>scsimp</b><i> (<var>expr</var>, <var>rule_1</var>, &hellip;, <var>rule_n</var>)</i>
<a name="IDX322"></a>
</dt>
<dd><p>Sequential Comparative Simplification (method due to Stoute).
<code>scsimp</code> attempts to simplify <var>expr</var>
according to the rules <var>rule_1</var>, &hellip;, <var>rule_n</var>.
If a smaller expression is obtained, the process repeats.  Otherwise after all
simplifications are tried, it returns the original answer.
</p>
<p><code>example (scsimp)</code> displays some examples.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Simplification-functions">Simplification functions</a>
</p>
</div>

</dd></dl>

<p><a name="simp"></a>
<a name="Item_003a-simp"></a>
</p><dl>
<dt><u>Option variable:</u> <b>simp</b>
<a name="IDX323"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p><code>simp</code> enables simplification.  This is the standard.  <code>simp</code> is also
an <code>evflag</code>, which is recognized by the function <code>ev</code>.  See <code>ev</code>.
</p>
<p>When <code>simp</code> is used as an <code>evflag</code> with a value <code>false</code>, the 
simplification is suppressed only during the evaluation phase of an expression.
The flag can not suppress the simplification which follows the evaluation 
phase.
</p>
<p>Examples:
</p>
<p>The simplification is switched off globally.  The expression <code>sin(1.0)</code> is
not simplified to its numerical value.  The <code>simp</code>-flag switches the
simplification on.
</p>
<pre class="example">(%i1) simp:false;
(%o1)                                false
(%i2) sin(1.0);
(%o2)                              sin(1.0)
(%i3) sin(1.0),simp;
(%o3)                          .8414709848078965
</pre>
<p>The simplification is switched on again.  The <code>simp</code>-flag cannot suppress
the simplification completely.  The output shows a simplified expression, but
the variable <code>x</code> has an unsimplified expression as a value, because the
assignment has occurred during the evaluation phase of the expression.
</p>
<pre class="example">(%i4) simp:true;
(%o4)                                true
(%i5) x:sin(1.0),simp:false;
(%o5)                          .8414709848078965
(%i6) :lisp $X
((%SIN) 1.0)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Evaluation-flags">Evaluation flags</a>
</p>
</div>

</dd></dl>


<p><a name="symmetric"></a>
<a name="Item_003a-symmetric"></a>
</p><dl>
<dt><u>Property:</u> <b>symmetric</b>
<a name="IDX324"></a>
</dt>
<dd><p><code>declare (h, symmetric)</code> tells the Maxima
simplifier that <code>h</code> is a symmetric function.  E.g., <code>h (x, z, y)</code> 
simplifies to <code>h (x, y, z)</code>.
</p>
<p><code>commutative</code> is synonymous with <code>symmetric</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
</p>
</div>

</dd></dl>

<p><a name="xthru"></a>
<a name="Item_003a-xthru"></a>
</p><dl>
<dt><u>Function:</u> <b>xthru</b><i> (<var>expr</var>)</i>
<a name="IDX325"></a>
</dt>
<dd><p>Combines all terms of <var>expr</var> (which should be a sum) over a common
denominator without expanding products and exponentiated sums as <code>ratsimp</code>
does.  <code>xthru</code> cancels common factors in the numerator and denominator of
rational expressions but only if the factors are explicit.
</p>
<p>Sometimes it is better to use <code>xthru</code> before <code>ratsimp</code>ing an
expression in order to cause explicit factors of the gcd of the numerator and
denominator to be canceled thus simplifying the expression to be
<code>ratsimp</code>ed.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) ((x+2)^20 - 2*y)/(x+y)^20 + (x+y)^(-19) - x/(x+y)^20;
                                20
                 1       (x + 2)   - 2 y       x
(%o1)        --------- + --------------- - ---------
                    19             20             20
             (y + x)        (y + x)        (y + x)
(%i2) xthru (%);
                                 20
                          (x + 2)   - y
(%o2)                     -------------
                                   20
                            (y + x)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="Item_003a-Mathematical-Functions"></a>
</p><hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC45" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_10.html#SEC47" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated on <i>January, 6 2012</i> using <a href="http://texi2html.cvshome.org/"><i>texi2html 1.76</i></a>.
 </font>
 <br>

</p>
</body>
</html>
